
#include "ttp224.h"

/******************************************************************
 * 函 数 名 称：TTP224_GPIO_Init
 * 函 数 说 明：对电容式触摸芯片TTP224进行初始化
 * 函 数 形 参：无
 * 函 数 返 回：无
 * 作       者：LC
 * 备       注：无
******************************************************************/
void TTP224_GPIO_Init(void)
{
        GPIO_InitTypeDef  GPIO_InitStructure;
        RCC_APB2PeriphClockCmd(RCC_TTP, ENABLE);

        GPIO_InitStructure.GPIO_Pin = GPIO_IN1|GPIO_IN2|GPIO_IN3|GPIO_IN4;
        GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IPD;    // 下拉输入
        GPIO_Init(PORT_TTP, &GPIO_InitStructure);

        GPIO_ResetBits(PORT_TTP, GPIO_IN1|GPIO_IN2|GPIO_IN3|GPIO_IN4);
}

/******************************************************************
 * 函 数 名 称：Key_IN1_Scanf
 * 函 数 说 明：返回触摸键1引脚电平状态
 * 函 数 形 参：无
 * 函 数 返 回：0=未检测到有触摸  1=检测到触摸
 * 作       者：LC
 * 备       注：无
******************************************************************/
char Key_IN1_Scanf(void)
{
    return KEY_IN1;
}
/******************************************************************
 * 函 数 名 称：Key_IN2_Scanf
 * 函 数 说 明：返回触摸键2引脚电平状态
 * 函 数 形 参：无
 * 函 数 返 回：0=未检测到有触摸  1=检测到触摸
 * 作       者：LC
 * 备       注：无
******************************************************************/

char Key_IN2_Scanf(void)
{
    return KEY_IN2;
}
/******************************************************************
 * 函 数 名 称：Key_IN3_Scanf
 * 函 数 说 明：返回触摸键3引脚电平状态
 * 函 数 形 参：无
 * 函 数 返 回：0=未检测到有触摸  1=检测到触摸
 * 作       者：LC
 * 备       注：无
******************************************************************/

char Key_IN3_Scanf(void)
{
    return KEY_IN3;
}
/******************************************************************
 * 函 数 名 称：Key_IN4_Scanf
 * 函 数 说 明：返回触摸键4引脚电平状态
 * 函 数 形 参：无
 * 函 数 返 回：0=未检测到有触摸  1=检测到触摸
 * 作       者：LC
 * 备       注：无
******************************************************************/
char Key_IN4_Scanf(void)
{
    return KEY_IN4;
}